Tekla Open API Reference for Tekla Structures 2025
StructuresExtender.GetIsFilter Method
 Retrieves the IsFilter boolean value associated with the specified control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetIsFilter(
	Control control
)
Public Function GetIsFilter (
	control As Control
) As Boolean
Parameters
control
Type: System.Windows.Forms.Control
The control for which to retrieve the IsFilter value.
Return Value
Type: Boolean
 A boolean containing the IsFilter value for the specified control.
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace